In [1]:
import pandas as pd

In [125]:
import numpy as np

In [87]:
df = pd.DataFrame({
    'name':['john','mary','peter','jeff','bill','lisa'],
    'age':[23,78,22,19,45,33],
    'state':['iowa','dc','california','texas','washington','dc'],
    'num_children':[2,2,0,1,2,1],
    'num_pets':[0,4,0,5,0,0]
})

In [16]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

## CHANGING INDEX OF DF

In [46]:
df = df.set_index('name', )
# you can change the index of df

In [18]:
df

       age       state  num_children  num_pets
name
john    23        iowa             2         0
mary    78          dc             2         4
peter   22  california             0         0
jeff    19       texas             1         5
bill    45  washington             2         0
lisa    33          dc             1         0

In [21]:
df.reset_index(inplace=True)

## changing the order of the columns

In [45]:
df = df[['age', 'state', 'name','num_children', 'num_pets']]

In [23]:
df

   age       state   name  num_children  num_pets
0   23        iowa   john             2         0
1   78          dc   mary             2         4
2   22  california  peter             0         0
3   19       texas   jeff             1         5
4   45  washington   bill             2         0
5   33          dc   lisa             1         0

In [28]:
df = df[['name', 'age','state','num_children', 'num_pets']]

In [44]:
df.to_csv('my_first_csv_file2.csv', index=False)
## To get rid of unnamed column set index=False

In [33]:
df2 = pd.read_csv('my_first_csv_file2.csv', )

In [34]:
df2.head()

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0

## Selecting Rows by position

In [35]:
df2.iloc[2]

name                 peter
age                     22
state           california
num_children             0
num_pets                 0
Name: 2, dtype: object

In [113]:
df

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4
3   peter   22  california             0         0
4    jeff   19       texas             1         5
5    bill   45  washington             2         0
6    lisa   33          dc             1         0

## iloc does not include the upper bound

In [41]:
df2.iloc[2:3,:]

    name  age       state  num_children  num_pets
2  peter   22  california             0         0

## loc does include the upper bound

In [43]:
df2.loc[2:3,:]

    name  age       state  num_children  num_pets
2  peter   22  california             0         0
3   jeff   19       texas             1         5

## Selecting last 2 rows

In [168]:
df.iloc[-2:]

   name  age       state  num_children  num_pets
5  bill   45  washington             2         0
6  lisa   33          dc             1         0

In [169]:
df.tail(2)

   name  age       state  num_children  num_pets
5  bill   45  washington             2         0
6  lisa   33          dc             1         0

## Filtering by a value

In [47]:
df[df['age']>30]

      age       state  num_children  num_pets
name
mary   78          dc             2         4
bill   45  washington             2         0
lisa   33          dc             1         0

In [48]:
df[df['num_pets'] > df['num_children']]

      age  state  num_children  num_pets
name
mary   78     dc             2         4
jeff   19  texas             1         5

In [52]:
df[(df['age'] >40) & (df['num_pets']>0)]

      age state  num_children  num_pets
name
mary   78    dc             2         4

## SELECTING COLUMNS START WITH 'N'

In [58]:
df2.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [57]:
df2.columns.str.startswith('n')

array([ True, False, False,  True,  True])

In [73]:
df2.iloc[:,df2.columns.str.startswith('n')]

    name  num_children  num_pets
0   john             2         0
1   mary             2         4
2  peter             0         0
3   jeff             1         5
4   bill             2         0
5   lisa             1         0

## Select All Columns But One

In [170]:
df.drop(['age'], axis=1)

     name       state  num_children  num_pets
0  serdar  new jersey             2         0
1    john        iowa             2         0
2    mary          dc             2         4
3   peter  california             0         0
4    jeff       texas             1         5
5    bill  washington             2         0
6    lisa          dc             1         0

## Drop a column

In [75]:
df.drop(['age', 'num_children'], axis=1)

            state  num_pets
name
john         iowa         0
mary           dc         4
peter  california         0
jeff        texas         5
bill   washington         0
lisa           dc         0

In [76]:
df.reset_index(inplace=True)

In [77]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [ ]:
del df['column']

## Uppercase/Lowercase all column names

In [195]:
# 1st Way
df.columns = df.columns.map(lambda x: x.upper())
df.head()

     NAME  AGE       STATE  NUM_CHILDREN  NUM_PETS
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4
3   peter   22  california             0         0
4    jeff   19       texas             1         5

In [196]:
# 2nd Way
df.columns = map(str.lower, df.columns)
df.head()

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4
3   peter   22  california             0         0
4    jeff   19       texas             1         5

## Change all NanNs to None (useful before loading to a db)

In [ ]:
df = df.where(pd.notnull(df), None)

## Get rid of non-numeric values throughout a DataFrame:

In [ ]:
import re

for col in df.columns.values:
    df[col] = refunds[col].replace('[^0-9]+.-', '', regex=True)

## Set DataFrame column values based on other column values

We are gonna set `age 55` for the rows which `names startwith 'j'`  `OR` `num_children>1`

In [198]:
df.loc[(df['name'].str.startswith('j')) | (df['num_children'] > 1), ['age']] = 55

In [199]:
df

     name  age       state  num_children  num_pets
0  serdar   55  new jersey             2         0
1    john   55        iowa             2         0
2    mary   55          dc             2         4
3   peter   22  california             0         0
4    jeff   55       texas             1         5
5    bill   55  washington             2         0
6    lisa   33          dc             1         0

In [200]:
pd.pivot_table(df, index='name', columns='state', values='num_children')

state   california   dc  iowa  new jersey  texas  washington
name
bill           NaN  NaN   NaN         NaN    NaN         2.0
jeff           NaN  NaN   NaN         NaN    1.0         NaN
john           NaN  NaN   2.0         NaN    NaN         NaN
lisa           NaN  1.0   NaN         NaN    NaN         NaN
mary           NaN  2.0   NaN         NaN    NaN         NaN
peter          0.0  NaN   NaN         NaN    NaN         NaN
serdar         NaN  NaN   NaN         2.0    NaN         NaN

## Filling Missing Values

In [ ]:
df = df.fillna({
    'col1': 'missing',
    'col2': '99.999',
    'col3': '999',
    'col4': 'missing',
    'col5': 'missing',
    'col6': '99'
})

## INSERTING A NEW ROW TO THE TOP OF THE DF

In [88]:
df.loc[-1] = ['serdar', 24, 'new jersey', 2, 0]

In [89]:
df

      name  age       state  num_children  num_pets
 0    john   23        iowa             2         0
 1    mary   78          dc             2         4
 2   peter   22  california             0         0
 3    jeff   19       texas             1         5
 4    bill   45  washington             2         0
 5    lisa   33          dc             1         0
-1  serdar   24  new jersey             2         0

In [90]:
df.index = df.index+1
df.sort_index(inplace=True)

In [91]:
df

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4
3   peter   22  california             0         0
4    jeff   19       texas             1         5
5    bill   45  washington             2         0
6    lisa   33          dc             1         0

## APPLYING AN AGGREGATE FUNC TO EVERY COLUMN

In [95]:
df[['age', 'num_children', 'num_pets']].apply(lambda x: np.mean(x), axis=0)

age             34.857143
num_children     1.428571
num_pets         1.285714
dtype: float64

## APPLYING AN AGGREGATE FUNC TO EVERY ROW

In [96]:
df[['age', 'num_children', 'num_pets']].apply(lambda x: np.mean(x), axis=1)

0     8.666667
1     8.333333
2    28.000000
3     7.333333
4     8.333333
5    15.666667
6    11.333333
dtype: float64

## Apply a function elementwise using Map

In [98]:
df[['name']].apply(lambda value: value.str.upper())

     name
0  SERDAR
1    JOHN
2    MARY
3   PETER
4    JEFF
5    BILL
6    LISA

In [99]:
df[['age']].apply(lambda value : value*2)

   age
0   48
1   46
2  156
3   44
4   38
5   90
6   66

## SHUFFLING DATASET

In [100]:
df = df.reindex(np.random.permutation(df.index))

In [101]:
df

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
4    jeff   19       texas             1         5
3   peter   22  california             0         0
6    lisa   33          dc             1         0
5    bill   45  washington             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4

In [102]:
df.sort_index(inplace=True)

In [103]:
df

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4
3   peter   22  california             0         0
4    jeff   19       texas             1         5
5    bill   45  washington             2         0
6    lisa   33          dc             1         0

## ITERATING OVER DATAFRAME

In [106]:
for index, row in df.iterrows():
    print(f"{index} has name {row['name']}")

0 has name serdar
1 has name john
2 has name mary
3 has name peter
4 has name jeff
5 has name bill
6 has name lisa

In [190]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, name='serdar', age=24, state='new jersey', num_children=2, num_pets=0)
Pandas(Index=1, name='john', age=23, state='iowa', num_children=2, num_pets=0)
Pandas(Index=2, name='mary', age=78, state='dc', num_children=2, num_pets=4)
Pandas(Index=3, name='peter', age=22, state='california', num_children=0, num_pets=0)
Pandas(Index=4, name='jeff', age=19, state='texas', num_children=1, num_pets=5)
Pandas(Index=5, name='bill', age=45, state='washington', num_children=2, num_pets=0)
Pandas(Index=6, name='lisa', age=33, state='dc', num_children=1, num_pets=0)

## SAMPLING FROM DF

In [110]:
df.sample(3)

    name  age       state  num_children  num_pets
1   john   23        iowa             2         0
5   bill   45  washington             2         0
3  peter   22  california             0         0

## SORTING DF BY COLUMN VALUE

In [112]:
df.sort_values('age', ascending=False)

     name  age       state  num_children  num_pets
2    mary   78          dc             2         4
5    bill   45  washington             2         0
6    lisa   33          dc             1         0
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
3   peter   22  california             0         0
4    jeff   19       texas             1         5

In [115]:
df.sort_values(['num_pets', 'age'], ascending=[False, True])

     name  age       state  num_children  num_pets
4    jeff   19       texas             1         5
2    mary   78          dc             2         4
3   peter   22  california             0         0
1    john   23        iowa             2         0
0  serdar   24  new jersey             2         0
6    lisa   33          dc             1         0
5    bill   45  washington             2         0

In [116]:

df3 = pd.DataFrame({
    'name':['john','mary','peter','jeff','bill','lisa'],
    'age':[23,78,22,19,12,33],
    'state':['N/A','dc','california','texas','N/A','dc']
})

In [117]:
df3

    name  age       state
0   john   23         N/A
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   12         N/A
5   lisa   33          dc

In [123]:
df3.sort_values(['state', 'age'], ascending=[False, True])

    name  age       state
3   jeff   19       texas
5   lisa   33          dc
1   mary   78          dc
2  peter   22  california
4   bill   12         N/A
0   john   23         N/A

In [ ]:
## Above is not what we want

In [133]:
def state_to_rank(state):
    if state=='N/A':
        return 1
    else:
        return 0

In [134]:
df3['rank'] = df3['state'].map(lambda x: state_to_rank(x))

In [136]:
df3.sort_values(by=['rank', 'age'])

    name  age       state  rank
3   jeff   19       texas     0
2  peter   22  california     0
5   lisa   33          dc     0
1   mary   78          dc     0
4   bill   12         N/A     1
0   john   23         N/A     1

## SELECT ROWS START WITH 'J' of NAMES

In [140]:
df3

    name  age       state  rank
0   john   23         N/A     1
1   mary   78          dc     0
2  peter   22  california     0
3   jeff   19       texas     0
4   bill   12         N/A     1
5   lisa   33          dc     0

In [139]:
df3['name'].str.startswith('j')

0     True
1    False
2    False
3     True
4    False
5    False
Name: name, dtype: bool

In [143]:
df3.loc[df3['name'].str.startswith('j')]

   name  age  state  rank
0  john   23    N/A     1
3  jeff   19  texas     0

In [172]:
df3[df3.apply(lambda row: row['name'].startswith('j'), axis=1)]

   name  age  state  rank
0  john   23    N/A     1
3  jeff   19  texas     0

## Changing Column Name

In [174]:
df3.rename(columns={'age':'age_years'})

    name  age_years       state  rank
0   john         23         N/A     1
1   mary         78          dc     0
2  peter         22  california     0
3   jeff         19       texas     0
4   bill         12         N/A     1
5   lisa         33          dc     0

## Changing Column Type

In [181]:
df['num_children'].dtype

dtype('int64')

In [182]:
# we don't need 64 bits for num_children
df['num_children'] = df['num_children'].astype('int32')
df['num_children'].dtype

dtype('int32')

In [183]:
# it looks the same but takes less space
df

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
2    mary   78          dc             2         4
3   peter   22  california             0         0
4    jeff   19       texas             1         5
5    bill   45  washington             2         0
6    lisa   33          dc             1         0

## Data Types and Conversion

In [ ]:
pd.to_numeric(df['name'])

In [188]:
# Convert Series datatype to numeric, changing non-numeric values to NaN
pd.to_numeric(df['name'], errors='coerce')

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
Name: name, dtype: float64

In [ ]:
# Change data type of DataFrame column

df.column_name = df.column_name.astype(np.int64)

## Duplicates

Get a report of all duplicate records in a DataFrame, based on specific columns

In [ ]:
dupes = df[df.duplicated(['col1', 'col2', 'col3'], keep=False)]

## SPLIT DATAFRAME BY COLUMN VALUE

In [145]:
grouped = df.groupby('num_pets')

In [146]:
grouped.groups.keys()
# we have 3 values in num_pets

dict_keys([0, 4, 5])

In [149]:
df0 = grouped.get_group(0)
# We subselect the pet number=0

In [148]:
df0

     name  age       state  num_children  num_pets
0  serdar   24  new jersey             2         0
1    john   23        iowa             2         0
3   peter   22  california             0         0
5    bill   45  washington             2         0
6    lisa   33          dc             1         0

## Apply multiple aggregation operations on a single GroupBy pass

Say, for instance, ORDER_DATE is a timestamp column. We want to find out the total quantity QTY AND the average UNIT price per day.

In [ ]:
grouped = df.groupby(p7.ORDER_DATE.dt.day).agg({
    "QTY":np.sum,
    "UNIT": np.mean})

## Verify that the dataframe includes specific values

This is done using the .isin() method, which returns a boolean dataframe to indicate where the passed values match.

In [156]:
# if the method is passed a simple list, it matches
# those values anywhere in the dataframe

In [151]:
df.isin([2,4])

    name    age  state  num_children  num_pets
0  False  False  False          True     False
1  False  False  False          True     False
2  False  False  False          True      True
3  False  False  False         False     False
4  False  False  False         False     False
5  False  False  False          True     False
6  False  False  False         False     False

In [157]:
# you can also pass a dict or another dataframe
# as argument

In [158]:
df.isin({'num_pets':[4,5]})

    name    age  state  num_children  num_pets
0  False  False  False         False     False
1  False  False  False         False     False
2  False  False  False         False      True
3  False  False  False         False     False
4  False  False  False         False      True
5  False  False  False         False     False
6  False  False  False         False     False

In [163]:
df.loc[df['num_pets'].isin([4,5])]

   name  age  state  num_children  num_pets
2  mary   78     dc             2         4
4  jeff   19  texas             1         5

## Create an empty Dataframe and append rows

In [164]:
# set column names and dtypes
new_df = pd.DataFrame(columns=['col_a','col_b']).astype({'col_a':'float32', 'col_b':'int8'})


# must reassign since the append method does not work in place
new_df = new_df.append({'col_a':5,'col_b':10}, ignore_index=True)
new_df = new_df.append({'col_a':1,'col_b':100}, ignore_index=True)

new_df

   col_a  col_b
0    5.0     10
1    1.0    100

In [165]:
index = pd.date_range('1/1/2000', periods=8)

In [166]:
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')